test/load/PDP.yml
config:
  target: 'https://m-perf.walgreens.com'
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Test-arrivalCount"
    - duration: 100  
      arrivalRate: 1
      rampTo: 3
      name: "Test-rampTo"
scenarios:
  - flow:
    - get:
        url: "/store/c/free-%26-clear-shampoo/ID=prod6055613-product"